// app.js
App({
	onLaunch()
	{
		wx.cloud.init();
  },
  //TODO:更新全局数据模块时，一定去吧Main里的模块也更新了
  globalData:{
    Publishs:['猫咪','猫粮','预防','配种'],
    CatModule:['狸花',  '橘猫',  '英短',  '美短',  '布偶',  '暹罗',  '缅因猫',  '波斯猫',  '伯曼猫',  '挪威森林猫',  '孟买猫',  '苏格兰折耳猫',  
    '加菲猫',  '东方短毛猫',  '金吉拉',  '无毛猫',  '德文卷毛猫',  '喜马拉雅猫',  '美国卷耳猫',  '阿比西尼亚猫',  '土耳其梵猫',  '雪鞋猫',  
    '曼基康猫',  '俄罗斯蓝猫',  '奥西猫',  '褴褛猫',  '孟买黑猫',  '巴厘猫',  '卷毛猫',  '丛林猫',  '东奇尼猫',  '塞尔凯克卷毛猫',  '临清狮子猫',  
    '三花猫',  '临清鸳鸯猫',  '山东狮子猫',  '奶牛猫',  '玄猫',  '白猫',  '蓝猫',  '蓝白',  '银渐层',  '金渐层',  '虎斑',  '标斑',  '起司',  
    '鱼骨纹',  '海双',  '蓝双',  '山爽',  '重点色'],
    
    CatFoodModule:['膨化粮','烘焙粮','风干粮','冻干粮','湿粮','生骨肉','处方粮', '无谷粮', '有机粮','高蛋白粮','高纤维粮', '敏感型猫粮',
    '幼猫粮','老年猫粮','室内猫粮','室外猫粮',],

    BreedingModule:['猫瘟',  '猫鼻支',  '尿闭',  '耳螨',  '胰腺炎',  '猫藓',  '上呼吸道感染',  '下泌尿道疾病',  '口腔疾病',  
    '心脏病',  '眼部感染',  '皮肤病',  '肠胃疾病',  '寄生虫感染',  '肾脏疾病',  '糖尿病',  '过敏症',  '骨折与关节问题',  '传染病（如猫冠状病毒）',  
    '呼吸系统问题',  '猫白血病',  '猫免疫缺陷病毒',  '肿瘤',  '营养不良',  '肥胖症', ],
  }
});
